## Plan Result (demo-aks)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 0 to change, 7 to destroy.</code></pre>

* Create
  * azurerm_resource_group.kubernetes_resource_group[&#34;01&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;msnode&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0]
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.node_infrastructure_update_scale_set
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.update_checker[0]
* Delete
  * azurerm_resource_group.kubernetes_resource_group[&#34;00&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;msnode&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.node_infrastructure_update_scale_set
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.update_checker[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.kubernetes_resource_group["00"] will be destroyed
  # (because key ["00"] is not in for_each map)
  - resource "azurerm_resource_group" "kubernetes_resource_group" {
      - id       = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-00-rg" -> null
      - location = "uksouth" -> null
      - name     = "ss-demo-00-rg" -> null
      - tags     = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/aks-sds-deploy"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Medium"
          - "environment"  = "demo"
        } -> null

      - timeouts {}
    }

  # azurerm_resource_group.kubernetes_resource_group["01"] will be created
  + resource "azurerm_resource_group" "kubernetes_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ss-demo-01-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      - api_server_authorized_ip_ranges     = [] -> null
      - automatic_channel_upgrade           = "patch" -> null
      - azure_policy_enabled                = false -> null
      - disk_encryption_set_id              = "" -> null
      - dns_prefix                          = "k8s-ss-demo-aks" -> null
      - dns_prefix_private_cluster          = "" -> null
      - edge_zone                           = "" -> null
      - enable_pod_security_policy          = false -> null
      - fqdn                                = "k8s-ss-demo-aks-19424608.hcp.uksouth.azmk8s.io" -> null
      - http_application_routing_enabled    = false -> null
      - http_application_routing_zone_name  = "" -> null
      - id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-demo-00-aks" -> null
      - kube_admin_config                   = (sensitive value)
      - kube_admin_config_raw               = (sensitive value)
      - kube_config                         = (sensitive value)
      - kube_config_raw                     = (sensitive value)
      - kubernetes_version                  = "1.24" -> null
      - local_account_disabled              = false -> null
      - location                            = "uksouth" -> null
      - name                                = "ss-demo-00-aks" -> null
      - node_resource_group                 = "ss-demo-00-aks-node-rg" -> null
      - oidc_issuer_enabled                 = true -> null
      - oidc_issuer_url                     = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/4d0ff99e-d4f3-43df-9884-9cacd7b833e9/" -> null
      - open_service_mesh_enabled           = false -> null
      - portal_fqdn                         = "k8s-ss-demo-aks-19424608.portal.hcp.uksouth.azmk8s.io" -> null
      - private_cluster_enabled             = false -> null
      - private_cluster_public_fqdn_enabled = false -> null
      - private_dns_zone_id                 = "" -> null
      - private_fqdn                        = "" -> null
      - public_network_access_enabled       = true -> null
      - resource_group_name                 = "ss-demo-00-rg" -> null
      - role_based_access_control_enabled   = true -> null
      - run_command_enabled                 = true -> null
      - sku_tier                            = "Free" -> null
      - tags                                = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/aks-sds-deploy"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Medium"
          - "environment"  = "demo"
        } -> null
      - workload_identity_enabled           = false -> null

      - auto_scaler_profile {
          - balance_similar_node_groups      = false -> null
          - empty_bulk_delete_max            = "10" -> null
          - expander                         = "random" -> null
          - max_graceful_termination_sec     = "600" -> null
          - max_node_provisioning_time       = "15m" -> null
          - max_unready_nodes                = 3 -> null
          - max_unready_percentage           = 45 -> null
          - new_pod_scale_up_delay           = "0s" -> null
          - scale_down_delay_after_add       = "10m" -> null
          - scale_down_delay_after_delete    = "10s" -> null
          - scale_down_delay_after_failure   = "3m" -> null
          - scale_down_unneeded              = "10m" -> null
          - scale_down_unready               = "20m" -> null
          - scale_down_utilization_threshold = "0.5" -> null
          - scan_interval                    = "10s" -> null
          - skip_nodes_with_local_storage    = false -> null
          - skip_nodes_with_system_pods      = true -> null
        }

      - azure_active_directory_role_based_access_control {
          - admin_group_object_ids = [
              - "a6ce5b32-e0a5-419e-ba5c-67863c975941",
              - (sensitive value),
            ] -> null
          - azure_rbac_enabled     = false -> null
          - client_app_id          = "" -> null
          - managed                = true -> null
          - server_app_id          = "" -> null
          - server_app_secret      = (sensitive value)
          - tenant_id              = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        }

      - default_node_pool {
          - enable_auto_scaling          = true -> null
          - enable_host_encryption       = false -> null
          - enable_node_public_ip        = false -> null
          - fips_enabled                 = false -> null
          - kubelet_disk_type            = "OS" -> null
          - max_count                    = 4 -> null
          - max_pods                     = 50 -> null
          - min_count                    = 2 -> null
          - name                         = "system" -> null
          - node_count                   = 2 -> null
          - node_labels                  = {} -> null
          - node_taints                  = [] -> null
          - only_critical_addons_enabled = true -> null
          - orchestrator_version         = "1.24" -> null
          - os_disk_size_gb              = 128 -> null
          - os_disk_type                 = "Ephemeral" -> null
          - os_sku                       = "Ubuntu" -> null
          - scale_down_mode              = "Delete" -> null
          - tags                         = {
              - "application"  = "core"
              - "builtFrom"    = "hmcts/aks-sds-deploy"
              - "businessArea" = "Cross-Cutting"
              - "criticality"  = "Medium"
              - "environment"  = "demo"
            } -> null
          - type                         = "VirtualMachineScaleSets" -> null
          - ultra_ssd_enabled            = false -> null
          - vm_size                      = "Standard_DS3_v2" -> null
          - vnet_subnet_id               = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/virtualNetworks/ss-demo-vnet/subnets/aks-00" -> null
          - zones                        = [
              - "1",
            ] -> null
        }

      - identity {
          - identity_ids = [
              - "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-demo-mi",
            ] -> null
          - type         = "UserAssigned" -> null
        }

      - key_vault_secrets_provider {
          - secret_identity          = [
              - {
                  - client_id                 = "ab88dbbe-4c10-4185-991b-04c2711700b9"
                  - object_id                 = "1233c14d-96f0-46a8-bb6f-07241de75e74"
                  - user_assigned_identity_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourcegroups/ss-demo-00-aks-node-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azurekeyvaultsecretsprovider-ss-demo-00-aks"
                },
            ] -> null
          - secret_rotation_enabled  = true -> null
          - secret_rotation_interval = "5m" -> null
        }

      - kubelet_identity {
          - client_id                 = "1f8ce2db-8873-440b-af0b-9ce510fd0385" -> null
          - object_id                 = "4a8907ff-bf6f-4b5d-92d0-4a95e6882ef6" -> null
          - user_assigned_identity_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-kubelet-demo-mi" -> null
        }

      - linux_profile {
          - admin_username = "k8sadmin" -> null

          - ssh_key {
              - key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCqPFmlkJn9vCOklB9wOJEAr+h36naEvWCH2LP6wVMTnbWkgwwhRvtVGeFeDo5jhlTJGk8/RyCnuQpoKfvfYNqr/5fhr0xa7CNJhb2NdUmv8u811APXKaf8psElQz4LzFb6HBcKapkVB1DQwUCVREY+BCnXtBZ1v6V24TO9YbJASs/BaPgZQJLThVGNe24jV0zRWDAy1RElPT8P1wO4k5hoDXg4NRoQt5IxqcpTUncVGN705ggqLf96zS70fPVlhLL5L6yBv4/0y9t4uo7NR5mKwDIRlpyXONpFpMGzj0zWLm/HDQqZNrD4Ycs2UolJcBk+YlUXTV6VyrnpmyKoVGvlOW8IpJLASW8HalNeOWTw5WsbjpY8rCrgasO6lMC3tI7t8yqFHFJ+EAqYZtVJoLO+ag97QZADlm2vcvctSGCAr8hqwYfb2UqqlDTuX/H8USqelCNa5NJAH7IMF1p1M9n0ohvT91U3KdtUvgu/8psuIXD1iEDNKQ3gwManbeRQ79M=" -> null
            }
        }

      - network_profile {
          - dns_service_ip     = "10.0.0.10" -> null
          - docker_bridge_cidr = "172.17.0.1/16" -> null
          - ip_versions        = [
              - "IPv4",
            ] -> null
          - load_balancer_sku  = "standard" -> null
          - network_plugin     = "azure" -> null
          - outbound_type      = "loadBalancer" -> null
          - pod_cidrs          = [] -> null
          - service_cidr       = "10.0.0.0/16" -> null
          - service_cidrs      = [
              - "10.0.0.0/16",
            ] -> null

          - load_balancer_profile {
              - effective_outbound_ips      = [
                  - "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-00-aks-node-rg/providers/Microsoft.Network/publicIPAddresses/c17ba1d9-7049-4335-9ad8-2fdb2d28213b",
                ] -> null
              - idle_timeout_in_minutes     = 0 -> null
              - managed_outbound_ip_count   = 1 -> null
              - managed_outbound_ipv6_count = 0 -> null
              - outbound_ip_address_ids     = [] -> null
              - outbound_ip_prefix_ids      = [] -> null
              - outbound_ports_allocated    = 0 -> null
            }
        }

      - windows_profile {
          - admin_username = "azureuser" -> null
        }
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - enable_auto_scaling    = true -> null
      - enable_host_encryption = false -> null
      - enable_node_public_ip  = false -> null
      - fips_enabled           = false -> null
      - id                     = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-demo-00-aks/agentPools/linux" -> null
      - kubelet_disk_type      = "OS" -> null
      - kubernetes_cluster_id  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-demo-00-aks" -> null
      - max_count              = 10 -> null
      - max_pods               = 30 -> null
      - min_count              = 2 -> null
      - mode                   = "User" -> null
      - name                   = "linux" -> null
      - node_count             = 8 -> null
      - node_labels            = {} -> null
      - node_taints            = [] -> null
      - orchestrator_version   = "1.24" -> null
      - os_disk_size_gb        = 128 -> null
      - os_disk_type           = "Ephemeral" -> null
      - os_sku                 = "Ubuntu" -> null
      - os_type                = "Linux" -> null
      - priority               = "Regular" -> null
      - scale_down_mode        = "Delete" -> null
      - spot_max_price         = -1 -> null
      - tags                   = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/aks-sds-deploy"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Medium"
          - "environment"  = "demo"
        } -> null
      - ultra_ssd_enabled      = false -> null
      - vm_size                = "Standard_DS3_v2" -> null
      - vnet_subnet_id         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/virtualNetworks/ss-demo-vnet/subnets/aks-00" -> null
      - zones                  = [
          - "1",
        ] -> null

      - timeouts {
          - update = "180m" -> null
        }

      - upgrade_settings {
          - max_surge = "33%" -> null
        }
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["msnode"] will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - enable_auto_scaling    = true -> null
      - enable_host_encryption = false -> null
      - enable_node_public_ip  = false -> null
      - fips_enabled           = false -> null
      - id                     = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-demo-00-aks/agentPools/msnode" -> null
      - kubelet_disk_type      = "OS" -> null
      - kubernetes_cluster_id  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-demo-00-aks" -> null
      - max_count              = 4 -> null
      - max_pods               = 30 -> null
      - min_count              = 2 -> null
      - mode                   = "User" -> null
      - name                   = "msnode" -> null
      - node_count             = 2 -> null
      - node_labels            = {} -> null
      - node_taints            = [
          - "kubernetes.io/os=windows:NoSchedule",
        ] -> null
      - orchestrator_version   = "1.24" -> null
      - os_disk_size_gb        = 128 -> null
      - os_disk_type           = "Ephemeral" -> null
      - os_sku                 = "Windows2019" -> null
      - os_type                = "Windows" -> null
      - priority               = "Regular" -> null
      - scale_down_mode        = "Delete" -> null
      - spot_max_price         = -1 -> null
      - tags                   = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/aks-sds-deploy"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Medium"
          - "environment"  = "demo"
        } -> null
      - ultra_ssd_enabled      = false -> null
      - vm_size                = "Standard_DS3_v2" -> null
      - vnet_subnet_id         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/virtualNetworks/ss-demo-vnet/subnets/aks-00" -> null
      - zones                  = [
          - "1",
        ] -> null

      - timeouts {
          - update = "180m" -> null
        }

      - upgrade_settings {
          - max_surge = "33%" -> null
        }
    }

  # module.kubernetes["00"].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0] will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting" {
      - id                         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-demo-00-aks|DiagLogAnalytics" -> null
      - log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod" -> null
      - name                       = "DiagLogAnalytics" -> null
      - target_resource_id         = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-demo-00-aks" -> null

      - log {
          - category = "cloud-controller-manager" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "cluster-autoscaler" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "csi-azuredisk-controller" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "csi-azurefile-controller" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "csi-snapshot-controller" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "guard" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "kube-apiserver" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "kube-audit" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "kube-audit-admin" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "kube-controller-manager" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "kube-scheduler" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 30 -> null
              - enabled = true -> null
            }
        }
    }

  # module.kubernetes["00"].azurerm_role_assignment.node_infrastructure_update_scale_set will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      - id                   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-00-aks-node-rg/providers/Microsoft.Authorization/roleAssignments/8ded471b-3f96-7297-25f6-a1cb55450213" -> null
      - name                 = "8ded471b-3f96-7297-25f6-a1cb55450213" -> null
      - principal_id         = "4a8907ff-bf6f-4b5d-92d0-4a95e6882ef6" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> null
      - role_definition_name = "Virtual Machine Contributor" -> null
      - scope                = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-00-aks-node-rg" -> null
    }

  # module.kubernetes["00"].azurerm_role_assignment.update_checker[0] will be destroyed
  # (because module.kubernetes["00"] is not in configuration)
  - resource "azurerm_role_assignment" "update_checker" {
      - id                   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-demo-00-aks/providers/Microsoft.Authorization/roleAssignments/2de0823e-5515-43e2-ef34-e2202dccca20" -> null
      - name                 = "2de0823e-5515-43e2-ef34-e2202dccca20" -> null
      - principal_id         = "8de130f9-2f85-4339-a351-a747fcd09e2b" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> null
      - role_definition_name = "Reader" -> null
      - scope                = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-demo-00-aks" -> null
    }

  # module.kubernetes["01"].data.azurerm_resource_group.node_resource_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "node_resource_group" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "ss-demo-01-aks-node-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster.kubernetes_cluster will be created
  + resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      + automatic_channel_upgrade           = "patch"
      + dns_prefix                          = "k8s-ss-demo-aks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.24"
      + location                            = "uksouth"
      + name                                = "ss-demo-01-aks"
      + node_resource_group                 = "ss-demo-01-aks-node-rg"
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "ss-demo-01-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + tags                                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }
      + workload_identity_enabled           = false

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = [
              + "a6ce5b32-e0a5-419e-ba5c-67863c975941",
              + (sensitive value),
            ]
          + azure_rbac_enabled     = false
          + managed                = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling          = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 4
          + max_pods                     = 50
          + min_count                    = 2
          + name                         = "system"
          + node_count                   = (known after apply)
          + node_labels                  = (known after apply)
          + only_critical_addons_enabled = true
          + orchestrator_version         = "1.24"
          + os_disk_size_gb              = 128
          + os_disk_type                 = "Ephemeral"
          + os_sku                       = (known after apply)
          + scale_down_mode              = "Delete"
          + tags                         = {
              + "application"  = "core"
              + "builtFrom"    = "hmcts/aks-sds-deploy"
              + "businessArea" = "Cross-Cutting"
              + "criticality"  = "Medium"
              + "environment"  = "demo"
            }
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_DS3_v2"
          + vnet_subnet_id               = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/virtualNetworks/ss-demo-vnet/subnets/aks-01"
          + workload_runtime             = (known after apply)
          + zones                        = [
              + "1",
            ]
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-demo-mi",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "5m"
        }

      + kubelet_identity {
          + client_id                 = "1f8ce2db-8873-440b-af0b-9ce510fd0385"
          + object_id                 = "4a8907ff-bf6f-4b5d-92d0-4a95e6882ef6"
          + user_assigned_identity_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-kubelet-demo-mi"
        }

      + linux_profile {
          + admin_username = "k8sadmin"

          + ssh_key {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCqPFmlkJn9vCOklB9wOJEAr+h36naEvWCH2LP6wVMTnbWkgwwhRvtVGeFeDo5jhlTJGk8/RyCnuQpoKfvfYNqr/5fhr0xa7CNJhb2NdUmv8u811APXKaf8psElQz4LzFb6HBcKapkVB1DQwUCVREY+BCnXtBZ1v6V24TO9YbJASs/BaPgZQJLThVGNe24jV0zRWDAy1RElPT8P1wO4k5hoDXg4NRoQt5IxqcpTUncVGN705ggqLf96zS70fPVlhLL5L6yBv4/0y9t4uo7NR5mKwDIRlpyXONpFpMGzj0zWLm/HDQqZNrD4Ycs2UolJcBk+YlUXTV6VyrnpmyKoVGvlOW8IpJLASW8HalNeOWTw5WsbjpY8rCrgasO6lMC3tI7t8yqFHFJ+EAqYZtVJoLO+ag97QZADlm2vcvctSGCAr8hqwYfb2UqqlDTuX/H8USqelCNa5NJAH7IMF1p1M9n0ohvT91U3KdtUvgu/8psuIXD1iEDNKQ3gwManbeRQ79M="
            }
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips      = (known after apply)
              + idle_timeout_in_minutes     = (known after apply)
              + managed_outbound_ip_count   = (known after apply)
              + managed_outbound_ipv6_count = (known after apply)
              + outbound_ip_address_ids     = (known after apply)
              + outbound_ip_prefix_ids      = (known after apply)
              + outbound_ports_allocated    = (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)

          + gmsa {
              + dns_server  = (known after apply)
              + root_domain = (known after apply)
            }
        }
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 10
      + max_pods              = 30
      + min_count             = 2
      + mode                  = "User"
      + name                  = "linux"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + node_taints           = []
      + orchestrator_version  = "1.24"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_DS3_v2"
      + vnet_subnet_id        = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/virtualNetworks/ss-demo-vnet/subnets/aks-01"
      + zones                 = [
          + "1",
        ]

      + timeouts {
          + update = "180m"
        }

      + upgrade_settings {
          + max_surge = "33%"
        }
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["msnode"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 4
      + max_pods              = 30
      + min_count             = 2
      + mode                  = "User"
      + name                  = "msnode"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + node_taints           = [
          + "kubernetes.io/os=windows:NoSchedule",
        ]
      + orchestrator_version  = "1.24"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = (known after apply)
      + os_type               = "Windows"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_DS3_v2"
      + vnet_subnet_id        = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/ss-demo-network-rg/providers/Microsoft.Network/virtualNetworks/ss-demo-vnet/subnets/aks-01"
      + zones                 = [
          + "1",
        ]

      + timeouts {
          + update = "180m"
        }

      + upgrade_settings {
          + max_surge = "33%"
        }
    }

  # module.kubernetes["01"].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                       = "DiagLogAnalytics"
      + target_resource_id         = (known after apply)

      + log {
          + category = "cluster-autoscaler"
          + enabled  = true
        }
      + log {
          + category = "guard"
          + enabled  = true
        }
      + log {
          + category = "kube-apiserver"
          + enabled  = true
        }
      + log {
          + category = "kube-audit-admin"
          + enabled  = false
        }
      + log {
          + category = "kube-controller-manager"
          + enabled  = true
        }
      + log {
          + category = "kube-scheduler"
          + enabled  = true
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.kubernetes["01"].azurerm_role_assignment.node_infrastructure_update_scale_set will be created
  + resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4a8907ff-bf6f-4b5d-92d0-4a95e6882ef6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["01"].azurerm_role_assignment.update_checker[0] will be created
  + resource "azurerm_role_assignment" "update_checker" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8de130f9-2f85-4339-a351-a747fcd09e2b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 7 to add, 0 to change, 7 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":322,"Program":"tfcmt","SHA1":"","Target":"demo-aks","Vars":{}} -->